In [1]:
import pandas as pd

CUSTOMERS_ADDRESSES_FILE_PATH = "../../csv_files/addresses.csv"
CITY_FILE_PATH = "../../csv_files/cities.csv"

Read CSV file

In [2]:
customers_addresses = pd.read_csv(CUSTOMERS_ADDRESSES_FILE_PATH)
cities = pd.read_csv(CITY_FILE_PATH, header=None, names=['city'])
print(customers_addresses.describe())

          company_id    total_spend
count  100000.000000  100000.000000
mean    50000.500000    4951.662000
std     28867.657797    1500.983866
min         1.000000       0.000000
25%     25000.750000    3900.000000
50%     50000.500000    5000.000000
75%     75000.250000    6000.000000
max    100000.000000   11700.000000

In [3]:
customers_addresses

,company_id,address,total_spend
0,1,"APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...",5700
1,2,"107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ",4700
2,3,"43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...",5900
3,4,"HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...",7200
4,5,"AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...",4600
...,...,...,...
99995,99996,"KNAPP HOUSE,\nSELSLEY WEST,\nSTROUD,\nGLOUCEST...",4600
99996,99997,"20 The Broadway, Hampton Court,\nWay, Thames D...",4100
99997,99998,"MARLAND HOUSE,\n13 HUDDERSFIELD ROAD,\nBARNSLE...",5600
99998,99999,"4 MOUNT SCAR VIEW,\nSCHOLES,\nHOLMFIRTH HUDDER...",4600
99999,100000,"Manningham Mills Community Center, Silk Wareho...",5100

In [4]:
cities

               city
0           England
1              Bath
2       Birmingham*
3         Bradford*
4   Brighton & Hove
..              ...
75          Newport
76         St Asaph
77        St Davids
78         Swansea*
79          Wrexham

[80 rows x 1 columns]

Data Profiling

In [5]:
customers_addresses.isnull().sum()
customers_addresses = customers_addresses.dropna(subset=['address'])
print(customers_addresses)

       company_id                                            address  \
0               1  APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...
1               2           107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ
2               3  43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...
3               4  HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...
4               5  AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...
...           ...                                                ...
99995       99996  KNAPP HOUSE,\nSELSLEY WEST,\nSTROUD,\nGLOUCEST...
99996       99997  20 The Broadway, Hampton Court,\nWay, Thames D...
99997       99998  MARLAND HOUSE,\n13 HUDDERSFIELD ROAD,\nBARNSLE...
99998       99999  4 MOUNT SCAR VIEW,\nSCHOLES,\nHOLMFIRTH HUDDER...
99999      100000  Manningham Mills Community Center, Silk Wareho...

       total_spend
0             5700
1             4700
2             5900
3             7200
4             4600
...            ...
99995         4600
99996         4100
99997         5600
99998         4600
99999         5100

[99032 rows x 3 columns]

In [6]:
print(customers_addresses['total_spend'].describe())

count    99032.000000
mean      4951.673197
std       1500.642398
min          0.000000
25%       3900.000000
50%       5000.000000
75%       6000.000000
max      11700.000000
Name: total_spend, dtype: float64

In [7]:
customers_addresses['address']

0        APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...
1                 107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ
2        43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...
3        HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...
4        AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...
                               ...
99995    KNAPP HOUSE,\nSELSLEY WEST,\nSTROUD,\nGLOUCEST...
99996    20 The Broadway, Hampton Court,\nWay, Thames D...
99997    MARLAND HOUSE,\n13 HUDDERSFIELD ROAD,\nBARNSLE...
99998    4 MOUNT SCAR VIEW,\nSCHOLES,\nHOLMFIRTH HUDDER...
99999    Manningham Mills Community Center, Silk Wareho...
Name: address, Length: 99032, dtype: object

In [8]:
customers_addresses['address_clean'] = customers_addresses['address'].str.upper()
print(len(customers_addresses[customers_addresses["address_clean"].str.contains("LONDON")]))
print(len(customers_addresses[customers_addresses["address_clean"].str.contains("LONDON,")]))

21768
20831

/var/folders/97/835pt_fd54749hk3wzm_wv2w0000gn/T/ipykernel_56260/1571102609.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_addresses['address_clean'] = customers_addresses['address'].str.upper()

In [9]:
customers_addresses['address_lines'] = customers_addresses['address_clean'].str.split('\n').apply(len)
customers_addresses['address_lines'].value_counts().sort_index()

/var/folders/97/835pt_fd54749hk3wzm_wv2w0000gn/T/ipykernel_56260/370793050.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_addresses['address_lines'] = customers_addresses['address_clean'].str.split('\n').apply(len)

address_lines
1        6
2       52
3     3284
4    35850
5    45931
6    13909
Name: count, dtype: int64

In [10]:
print(customers_addresses.loc[customers_addresses["address_lines"] == 1, "address_clean"])
print((
    customers_addresses[customers_addresses["address_lines"] == 2]
    .sample(5, random_state=42)
    ["address_clean"])
)

17789                      FALKIRK
31897                   HADDINGTON
61750          CREAG BHAITHEACHAIN
75330                     NEWMILNS
78045    REDCLOAK FARM, STONEHAVEN
90897     REFER TO PARENT REGISTRY
Name: address_clean, dtype: object
39443                                    FORFAR,\nANGUS
80846                        12 HOPE STREET,\nEDINBURGH
95979    BRANCH REGISTRATION,\nREFER TO PARENT REGISTRY
23563    BRANCH REGISTRATION,\nREFER TO PARENT REGISTRY
81155                             PO BOX 2230,\nGLASGOW
Name: address_clean, dtype: object

Next, process cleaning cities data

In [11]:
countries_to_remove = ["England", "Scotland", "Wales", "Northern Ireland"]
print(len(cities))

cities_to_remove_indexes = cities[cities['city'].isin(countries_to_remove)].index
cities = cities.drop(index=cities_to_remove_indexes)
print(f"Removed {len(cities_to_remove_indexes)} cities")

# Do trim and upper case
cities['city'] = cities['city'].str.replace("*", "", regex=False)
cities['city'] = cities['city'].str.upper()

cities

80
Removed 4 cities

               city
1              BATH
2        BIRMINGHAM
3          BRADFORD
4   BRIGHTON & HOVE
5           BRISTOL
..              ...
75          NEWPORT
76         ST ASAPH
77        ST DAVIDS
78          SWANSEA
79          WREXHAM

[76 rows x 1 columns]

Start assigning city for customer address

In [12]:
for city in cities['city']:
    customers_addresses.loc[customers_addresses['address_clean'].str.contains(city), 'city'] = city
customers_addresses.loc[customers_addresses["address_clean"].str.contains("HULL"), "city"] = "HULL"
customers_addresses['city'] = customers_addresses['city'].fillna('OTHER')

/var/folders/97/835pt_fd54749hk3wzm_wv2w0000gn/T/ipykernel_56260/1859301004.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_addresses.loc[customers_addresses['address_clean'].str.contains(city), 'city'] = city
/var/folders/97/835pt_fd54749hk3wzm_wv2w0000gn/T/ipykernel_56260/1859301004.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers_addresses['city'] = customers_addresses['city'].fillna('OTHER')

In [13]:
customers_addresses.head(10)

,company_id,address,total_spend,address_clean,address_lines,city
0,1,"APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...",5700,"APARTMENT 2,\n52 BEDFORD ROAD,\nLONDON,\nENGLA...",5,LONDON
1,2,"107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ",4700,"107 SHERINGHAM AVENUE,\nLONDON,\nN14 4UJ",3,LONDON
2,3,"43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...",5900,"43 SUNNINGDALE,\nYATE,\nBRISTOL,\nENGLAND,\nBS...",5,BRISTOL
3,4,"HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...",7200,"HAWESWATER HOUSE,\nLINGLEY MERE BUSINESS PARK,...",5,OTHER
4,5,"AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...",4600,"AMBERFIELD BARN HOUSE AMBER LANE,\nCHART SUTTO...",5,OTHER
5,6,"FIRST FLOOR CEF BUILDING,\nBROOMHILL WAY,\nTOR...",4600,"FIRST FLOOR CEF BUILDING,\nBROOMHILL WAY,\nTOR...",6,OTHER
6,7,"37 BEVERLEY ROAD,\nDRIFFIELD,\nENGLAND,\nYO25 6RZ",7300,"37 BEVERLEY ROAD,\nDRIFFIELD,\nENGLAND,\nYO25 6RZ",4,OTHER
7,8,"B82 ALBION RIVERSIDE BUILDING,\n8 HESTER ROAD,...",6100,"B82 ALBION RIVERSIDE BUILDING,\n8 HESTER ROAD,...",5,LONDON
8,9,"Flat 27, Domelton House,\nIron Mill Road,\nLon...",4200,"FLAT 27, DOMELTON HOUSE,\nIRON MILL ROAD,\nLON...",5,LONDON
9,10,"34 BROOKSIDE ESTATE,\nCHALGROVE,\nOXFORD,\nUNI...",5800,"34 BROOKSIDE ESTATE,\nCHALGROVE,\nOXFORD,\nUNI...",5,OXFORD

Exploring data

In [14]:
customers_addresses['city'].value_counts().head(20)

city
OTHER         46669
LONDON        21332
YORK           2546
MANCHESTER     2150
BIRMINGHAM     1823
GLASGOW        1304
LEICESTER      1184
BRISTOL        1137
EDINBURGH      1071
NOTTINGHAM     1035
LIVERPOOL       840
CARDIFF         817
LEEDS           748
DERBY           716
CHESTER         672
OXFORD          652
HULL            630
COVENTRY        603
LINCOLN         573
WORCESTER       572
Name: count, dtype: int64

In [15]:
# Find sample from OTHER city
other_sample = customers_addresses[customers_addresses['city'] == 'OTHER'].sample(5, random_state=42)
other_sample

,company_id,address,total_spend,address_clean,address_lines,city
29325,29326,"SUITES 11 - 16 PRUDENTIAL BUILDINGS,\n61 ST. P...",2700,"SUITES 11 - 16 PRUDENTIAL BUILDINGS,\n61 ST. P...",6,OTHER
22219,22220,"28 BULSTRODE PLACE,\nUPTON PARK,\nSLOUGH,\nBE...",3600,"28 BULSTRODE PLACE,\nUPTON PARK,\nSLOUGH,\nBE...",6,OTHER
23551,23552,"23 WOODCROFT AVENUE,\nLARGS,\nSCOTLAND,\nKA30 9EW",7900,"23 WOODCROFT AVENUE,\nLARGS,\nSCOTLAND,\nKA30 9EW",4,OTHER
47673,47674,"24 CANNON STREET,\nWINCHBURGH,\nBROXBURN,\nSCO...",4400,"24 CANNON STREET,\nWINCHBURGH,\nBROXBURN,\nSCO...",5,OTHER
65467,65468,"14 Parkfield Road,\nLong Buckby,\nNorthampton,...",4600,"14 PARKFIELD ROAD,\nLONG BUCKBY,\nNORTHAMPTON,...",5,OTHER

In [16]:
print("Total spend for all customers:")
print(customers_addresses["total_spend"].sum())

print("Total spend for London customers:")
print(customers_addresses.loc[customers_addresses["city"] == "LONDON", "total_spend"].sum())

print("Total spend outside London:")
print(customers_addresses.loc[customers_addresses["city"] != "LONDON", "total_spend"].sum())

print("Total spend outside London (excluding OTHER):")
print(customers_addresses.loc[customers_addresses["city"].isin(["LONDON", "OTHER"]) == False,
 "total_spend"].sum())

Total spend for all customers:
490374100
Total spend for London customers:
105821800
Total spend outside London:
384552300
Total spend outside London (excluding OTHER):
153516500

In [17]:
output_csv_file = customers_addresses.to_csv("../../csv_files/customers_addresses_with_city.csv",
                                             sep=";",  # delimiter
                                             encoding="utf-8",  # or "utf-8-sig" for Excel compatibility
                                             na_rep="",  # how NaN shows up in the file
                                             index=False,
                                             )
print(f"Saved to {output_csv_file}")

Saved to None